def vote():
    #  початок роботи системи голосування
    print('Voting System')

    # показ голосів для кожного кандидата
    c1, c2, c3 = 0, 0, 0

    #  цикл для збирання голосів
    while True:
        # робить вибір
        v = input('Vote for 1, 2, or 3 (or "stop" to end): ')

        # Перевірка голосування
        if v == 'stop':
            break
        # Якщо "1", додається голос для першого кандидата
        elif v == '1':
            c1 += 1
        # Якщо "2", додається голос для другого кандидата
        elif v == '2':
            c2 += 1
        # Якщо "3", додається голос для третього кандидата
        elif v == '3':
            c3 += 1
        # Якщо ні одне з трьох то неправильно введено
        else:
            print('Invalid vote! Please vote for 1, 2, or 3.')

    # Після завершення голосування виводяться результати
    print('Results:')
    print('1:', c1)  # Кількість голосів для кандидата 1
    print('2:', c2)  # Кількість голосів для кандидата 2
    print('3:', c3)  # Кількість голосів для кандидата 3


# Виклик функції
vote()